{
    "Права доступа": [
        {
            "проблема": "Пользователь не может войти в систему",
            "решение": "Проверьте учетные данные пользователя. Убедитесь, что пользователь добавлен в GLPI и имеет соответствующую роль. Проверьте подключение к LDAP/Active Directory, если используется доменная авторизация."
        },
        {
            "проблема": "Пользователь не видит необходимые элементы интерфейса",
            "решение": "Проверьте настройки профиля пользователя. Убедитесь, что у пользователя есть доступ к нужным модулям и правам. Проверьте, не изменялись ли глобальные разрешения в системе."
        },
        {
            "проблема": "Администратор не может изменить права пользователей",
            "решение": "Проверьте, входит ли администратор в группу с полными правами. Проверьте настройки глобальных профилей и убедитесь, что доступ к изменению прав не ограничен."
        },
        {
            "проблема": "Некоторые пользователи могут редактировать записи, хотя не должны",
            "решение": "Перепроверьте роли и права в настройках GLPI. Убедитесь, что доступ к редактированию ограничен только нужным группам пользователей."
        },
        {
            "проблема": "Ошибка при назначении ролей пользователям",
            "решение": "Проверьте, не повреждена ли база данных. Перепроверьте права текущего администратора. Попробуйте изменить роли через другой аккаунт с полными правами."
        },
        {
            "проблема": "Отделы/группы пользователей не отображаются корректно",
            "решение": "Проверьте, правильно ли настроены структуры организаций и их иерархия. Проверьте, загружены ли актуальные данные из LDAP, если используется внешняя аутентификация."
        },
        {
            "проблема": "Некоторые пользователи не могут отправлять заявки",
            "решение": "Проверьте, есть ли у пользователей права на создание заявок. Убедитесь, что они относятся к нужной группе. Проверьте настройки тикетов и их доступность для определённых категорий пользователей."
        }
    ],
    "Регламент": [
        {
            "проблема": "Некорректно работают SLA и автоматические правила обработки заявок",
            "решение": "Перепроверьте настройки SLA в GLPI. Убедитесь, что правильно настроены приоритеты заявок и триггеры. Перезапустите сервисы автоматической обработки."
        },
        {
            "проблема": "Нарушение сроков выполнения заявок",
            "решение": "Проверьте, корректно ли настроены дедлайны заявок. Убедитесь, что исполнители получают уведомления о новых задачах. Настройте автоматическое напоминание о просроченных задачах."
        },
        {
            "проблема": "Некорректная маршрутизация заявок",
            "решение": "Проверьте правила маршрутизации в GLPI. Убедитесь, что категории заявок правильно настроены и соответствуют ответственным группам."
        },
        {
            "проблема": "Автоматические уведомления не приходят пользователям",
            "решение": "Проверьте настройки SMTP-сервера в GLPI. Убедитесь, что почтовый сервер доступен и работает. Проверьте логи отправки почты на предмет ошибок."
        },
        {
            "проблема": "Некорректное отображение отчетов по заявкам",
            "решение": "Проверьте целостность данных в базе. Проверьте настройки отображения отчетов и права пользователей. Попробуйте обновить кэш системы."
        },
        {
            "проблема": "Не работает интеграция с Active Directory",
            "решение": "Проверьте соединение с сервером AD. Убедитесь, что указаны корректные учетные данные для подключения. Перепроверьте синтаксис LDAP-запросов в настройках."
        },
        {
            "проблема": "Некорректное распределение заявок между сотрудниками",
            "решение": "Проверьте настройки очереди заявок. Убедитесь, что правильные группы сотрудников назначены на обработку конкретных типов заявок. Настройте автоматическое распределение с учетом нагрузки."
        }
    ],
    "Базы данных": [
        {
            "проблема": "GLPI не может подключиться к базе данных",
            "решение": "Проверьте, запущен ли сервер базы данных. Убедитесь, что правильные учетные данные указаны в конфигурации. Проверьте настройки сети, если база данных находится на удаленном сервере."
        },
        {
            "проблема": "База данных медленно работает",
            "решение": "Оптимизируйте индексы в базе данных. Проверьте нагрузку на сервер БД. Убедитесь, что сервер имеет достаточно оперативной памяти и ресурсов процессора."
        },
        {
            "проблема": "Данные повреждены или утеряны",
            "решение": "Попробуйте восстановить данные из резервной копии. Проверьте целостность таблиц базы данных. Убедитесь, что бэкапы выполняются регулярно."
        },
        {
            "проблема": "Не удается обновить базу данных",
            "решение": "Проверьте права пользователя базы данных. Убедитесь, что установленная версия MySQL/MariaDB совместима с текущей версией GLPI. Попробуйте выполнить обновление вручную через командную строку."
        },
        {
            "проблема": "Некорректное отображение данных в интерфейсе",
            "решение": "Очистите кэш базы данных. Проверьте, не повреждены ли файлы конфигурации. Попробуйте выполнить проверку целостности базы через phpMyAdmin или командную строку."
        },
        {
            "проблема": "Резервные копии базы данных не создаются",
            "решение": "Проверьте настройки резервного копирования. Убедитесь, что сервер базы данных имеет достаточно места для создания резервных копий. Проверьте права доступа на запись в директорию хранения бэкапов."
        },
        {
            "проблема": "Частые ошибки в логах базы данных",
            "решение": "Анализируйте логи базы данных на предмет ошибок. Проверьте нагрузку на сервер и при необходимости выполните очистку устаревших данных. Обновите сервер базы данных до последней стабильной версии."
        }
    ]
}
