{
    "Камера": [
        {
            "проблема": "Нет доступа",
            "решение": "Проверьте кабельное или беспроводное соединение камеры. Убедитесь, что устройство включено. Проверьте права пользователя и настройки доступа в программном обеспечении наблюдения."
        },
        {
            "проблема": "Не записывается архив",
            "решение": "Убедитесь, что жесткий диск или сервер, на который производится запись, доступен и не заполнен. Проверьте права на запись у камеры. Удостоверьтесь, что запись включена в настройках камеры."
        },
        {
            "проблема": "Плохое качество изображения",
            "решение": "Очистите объектив камеры от грязи и пыли. Проверьте настройки разрешения и битрейта. Убедитесь, что камера получает достаточно света."
        },
        {
            "проблема": "Камера периодически отключается",
            "решение": "Проверьте качество интернет-соединения и стабильность источника питания. Если используется PoE, убедитесь, что мощности коммутатора хватает для питания камеры."
        },
        {
            "проблема": "Инфракрасная подсветка не работает",
            "решение": "Проверьте режим работы ИК-подсветки в настройках. Убедитесь, что вокруг камеры нет слишком яркого освещения, мешающего включению ночного режима."
        },
        {
            "проблема": "Камера не передает изображение в реальном времени",
            "решение": "Проверьте скорость интернет-соединения и нагрузку на сеть. Проверьте настройки потока в камере (битрейт, разрешение). Попробуйте обновить прошивку камеры."
        },
        {
            "проблема": "Запись ведется с задержками",
            "решение": "Проверьте, не перегружен ли сервер хранения. Очистите хранилище от старых записей. Убедитесь, что скорость сети достаточна для передачи данных."
        },
        {
            "проблема": "Камера не фокусируется",
            "решение": "Проверьте, не загрязнен ли объектив. Проверьте, включен ли автофокус. Если камера с фиксированным фокусом, попробуйте вручную настроить фокусное расстояние."
        }
    ],
    "Коммутатор": [
        {
            "проблема": "Нет питания",
            "решение": "Проверьте, подключен ли коммутатор к сети. Проверьте исправность блока питания. Если коммутатор PoE, убедитесь, что он получает достаточно мощности."
        },
        {
            "проблема": "Некоторые порты не работают",
            "решение": "Подключите устройство к другому порту. Проверьте состояние порта в веб-интерфейсе коммутатора. Возможно, порт отключен в настройках или поврежден физически."
        },
        {
            "проблема": "Коммутатор перегревается",
            "решение": "Убедитесь, что коммутатор не находится в замкнутом пространстве без вентиляции. Очистите вентиляционные отверстия от пыли."
        },
        {
            "проблема": "Периодически пропадает связь",
            "решение": "Проверьте кабели и разъемы. Перезапустите коммутатор. Если проблема сохраняется, обновите прошивку устройства."
        },
        {
            "проблема": "Нет доступа к веб-интерфейсу коммутатора",
            "решение": "Проверьте IP-адрес устройства. Убедитесь, что ваш компьютер находится в той же сети. Попробуйте сбросить настройки коммутатора до заводских."
        },
        {
            "проблема": "Скорость сети ниже ожидаемой",
            "решение": "Проверьте, нет ли перегрузки сети. Убедитесь, что используются качественные патч-корды и что нет поврежденных кабелей. Проверьте, не работает ли коммутатор в режиме 100 Мбит/с вместо 1 Гбит/с."
        },
        {
            "проблема": "Дублирование пакетов в сети",
            "решение": "Проверьте, нет ли петель в топологии сети. Убедитесь, что включен протокол Spanning Tree (STP) для предотвращения петель."
        }
    ]
}
    "Сервер": [
        {
            "проблема": "Сервер не включается",
            "решение": "Проверьте, подается ли питание на сервер. Проверьте состояние блока питания и замените его при необходимости. Проверьте индикаторы на корпусе."
        },
        {
            "проблема": "Сервер завис и не реагирует",
            "решение": "Попробуйте перезагрузить сервер через удаленное подключение или кнопкой на корпусе. Проверьте логи системы, возможно, проблема в нехватке ресурсов."
        },
        {
            "проблема": "Сервер перегревается",
            "решение": "Очистите систему охлаждения от пыли. Проверьте, работают ли вентиляторы. Убедитесь, что сервер не перегружен процессами."
        },
        {
            "проблема": "Нет связи с сервером по сети",
            "решение": "Проверьте сетевые кабели и настройки сети. Убедитесь, что сервер находится в той же подсети, что и клиентское устройство."
        },
        {
            "проблема": "Файловая система повреждена",
            "решение": "Запустите проверку файловой системы (fsck или chkdsk). Проверьте SMART-статус дисков и замените поврежденные."
        }
    ],
    "Роутер": [
        {
            "проблема": "Нет интернета",
            "решение": "Перезагрузите роутер. Проверьте соединение с провайдером и убедитесь, что услуга интернета активна."
        },
        {
            "проблема": "Низкая скорость интернета",
            "решение": "Поменяйте канал Wi-Fi в настройках роутера. Отключите ненужные устройства, которые могут загружать сеть."
        },
        {
            "проблема": "Wi-Fi не раздает сеть",
            "решение": "Убедитесь, что беспроводная сеть включена в настройках. Проверьте антенны и перезапустите устройство."
        },
        {
            "проблема": "Частые разрывы соединения",
            "решение": "Проверьте уровень сигнала Wi-Fi. Переместите роутер в центр помещения и обновите его прошивку."
        },
        {
            "проблема": "Не удается войти в настройки роутера",
            "решение": "Проверьте, что вы вводите правильный IP-адрес (обычно 192.168.1.1). Если логин/пароль забыты, выполните сброс настроек."
        }
    ],
    "Дисковый массив": [
        {
            "проблема": "Диск не обнаружен",
            "решение": "Проверьте физическое подключение диска. Проверьте, определяется ли он в BIOS. Попробуйте вставить его в другой слот."
        },
        {
            "проблема": "Массив в режиме деградации",
            "решение": "Один из дисков вышел из строя. Найдите неисправный диск с помощью утилиты мониторинга массива и замените его."
        },
        {
            "проблема": "Массив работает медленно",
            "решение": "Проверьте загрузку контроллера. Выполните дефрагментацию файловой системы. Убедитесь, что массив не перегружен операциями."
        },
        {
            "проблема": "Ошибка в логах массива",
            "решение": "Проанализируйте SMART-статус дисков. Проверьте кабели и порты подключения. Обновите прошивку контроллера."
        },
        {
            "проблема": "RAID-массив не загружается",
            "решение": "Проверьте настройки BIOS. Убедитесь, что загрузочный диск указан правильно. Попробуйте восстановить конфигурацию массива."
        }
    ]
}
