{
    "Сервер": [
        {
            "проблема": "Outlook не может подключиться к почтовому серверу",
            "решение": "Проверьте подключение к интернету. Убедитесь, что сервер работает и доступен. Проверьте настройки сервера в Outlook (SMTP, IMAP, POP3). Попробуйте перезапустить Outlook и компьютер."
        },
        {
            "проблема": "Outlook постоянно запрашивает пароль",
            "решение": "Проверьте правильность введенного пароля. Убедитесь, что учетные данные сохранены в 'Диспетчере учетных данных' Windows. Проверьте, не включена ли двухфакторная аутентификация и не требуется ли создание пароля приложения."
        },
        {
            "проблема": "Письма не отправляются",
            "решение": "Проверьте настройки SMTP-сервера в Outlook. Убедитесь, что антивирус или брандмауэр не блокируют соединение. Проверьте, не переполнен ли почтовый ящик или квота на отправку писем."
        },
        {
            "проблема": "Outlook зависает при подключении к серверу",
            "решение": "Попробуйте отключить надстройки через режим безопасного запуска Outlook (запуск с параметром /safe). Очистите кеш DNS командой `ipconfig /flushdns`. Проверьте скорость интернет-соединения."
        },
        {
            "проблема": "Некорректное отображение писем",
            "решение": "Проверьте кодировку в настройках Outlook. Проверьте, не поврежден ли профиль Outlook. Попробуйте отключить антивирус на время проверки."
        },
        {
            "проблема": "Outlook не получает новые письма",
            "решение": "Проверьте, включено ли автоматическое обновление папок. Очистите кеш Outlook. Проверьте настройки фильтров и правил обработки почты."
        },
        {
            "проблема": "Синхронизация с сервером Exchange не работает",
            "решение": "Перезапустите Outlook и попробуйте снова. Проверьте настройки автономного режима. Проверьте логи сервера Exchange на наличие ошибок."
        }
    ],
    "Резервное копирование": [
        {
            "проблема": "Не удается экспортировать почтовый ящик",
            "решение": "Проверьте, есть ли достаточно свободного места на диске. Попробуйте использовать другой формат экспорта (PST). Запустите Outlook от имени администратора."
        },
        {
            "проблема": "Ошибка при восстановлении PST-файла",
            "решение": "Используйте утилиту scanpst.exe для восстановления поврежденного файла. Проверьте, не открыт ли файл в другом процессе. Попробуйте восстановить из другой резервной копии."
        },
        {
            "проблема": "Автоматическое резервное копирование не выполняется",
            "решение": "Проверьте, включен ли параметр архивации в Outlook. Убедитесь, что у пользователя есть права записи в папку резервных копий. Проверьте настройки политики группы (GPO), запрещающей резервное копирование."
        },
        {
            "проблема": "Файл PST слишком большой",
            "решение": "Удалите старые письма или переместите их в архив. Используйте встроенный инструмент Outlook для сжатия PST-файла. Разделите почтовый ящик на несколько файлов."
        },
        {
            "проблема": "Резервная копия создается слишком долго",
            "решение": "Проверьте скорость диска и наличие свободного места. Закройте другие ресурсоемкие приложения. Попробуйте уменьшить размер почтового ящика перед резервным копированием."
        },
        {
            "проблема": "Outlook не видит файлы резервных копий",
            "решение": "Проверьте путь к файлу резервной копии. Убедитесь, что файл не поврежден. Попробуйте восстановить из более ранней резервной копии."
        },
        {
            "проблема": "Резервное копирование останавливается с ошибкой",
            "решение": "Проверьте логи событий Windows на наличие ошибок. Попробуйте выполнить резервное копирование в безопасном режиме. Отключите надстройки Outlook и повторите попытку."
        }
    ],
    "Обновления": [
        {
            "проблема": "После обновления Outlook не запускается",
            "решение": "Попробуйте запустить Outlook в безопасном режиме (`outlook.exe /safe`). Убедитесь, что обновление установлено корректно. Откатите обновление через 'Панель управления' → 'Программы и компоненты'."
        },
        {
            "проблема": "Некоторые функции Outlook пропали после обновления",
            "решение": "Проверьте, не изменились ли настройки учетной записи. Убедитесь, что в вашей версии Outlook поддерживаются нужные функции. Проверьте, не были ли отключены надстройки."
        },
        {
            "проблема": "Обновление Outlook зависает на установке",
            "решение": "Перезапустите компьютер и попробуйте снова. Проверьте, есть ли свободное место на диске. Запустите обновление вручную через 'Центр обновления Windows'."
        },
        {
            "проблема": "После обновления Outlook работает медленно",
            "решение": "Отключите ненужные надстройки. Очистите кеш Outlook. Проверьте, не перегружена ли система другими процессами."
        },
        {
            "проблема": "Обновление Outlook удалило сохраненные пароли",
            "решение": "Проверьте, не сбросились ли настройки учетных данных. Восстановите пароли через 'Диспетчер учетных данных' Windows. Убедитесь, что Outlook правильно подключается к серверу."
        },
        {
            "проблема": "После обновления Outlook не открывает вложения",
            "решение": "Проверьте настройки безопасности Outlook. Убедитесь, что вложения не блокируются антивирусом. Попробуйте сохранить вложение и открыть его вручную."
        },
        {
            "проблема": "Обновление Outlook удалило старые письма",
            "решение": "Проверьте настройки архивации. Восстановите письма из резервной копии. Проверьте, не включена ли синхронизация с сервером, которая могла удалить локальные данные."
        }
    ],
    "Почтовые ящики": [
        {
            "проблема": "Письма приходят с задержкой",
            "решение": "Проверьте настройки обновления почтовых папок. Убедитесь, что почтовый сервер работает без перебоев. Проверьте скорость интернет-соединения."
        },
        {
            "проблема": "Исчезли старые письма",
            "решение": "Проверьте настройки автоархивации. Поискать письма в папке 'Удаленные'. Проверьте, не включены ли фильтры, скрывающие старые письма."
        },
        {
            "проблема": "Письма автоматически попадают в спам",
            "решение": "Добавьте отправителей в список надежных адресов. Проверьте настройки спам-фильтра в Outlook и на сервере. Отключите антивирусное сканирование почты для теста."
        },
        {
            "проблема": "Отправленные письма не доходят до получателей",
            "решение": "Проверьте настройки SMTP-сервера. Убедитесь, что IP-адрес сервера не в черном списке. Проверьте, не заблокирован ли отправитель политиками компании."
        },
        {
            "проблема": "Письма отправляются дважды",
            "решение": "Проверьте, нет ли проблемы с синхронизацией. Отключите антивирус на время тестирования. Проверьте настройки правил обработки почты."
        },
        {
            "проблема": "Прикрепленные файлы не отправляются",
            "решение": "Убедитесь, что размер вложения не превышает лимит. Попробуйте отправить файл через облачное хранилище. Проверьте настройки безопасности Outlook."
        },
        {
            "проблема": "Некоторые письма не отображаются в Outlook",
            "решение": "Проверьте фильтры и категории. Очистите кеш почтового ящика. Проверьте, не были ли письма случайно перемещены в другую папку."
        }
    ]
}
