
{
    "Сервер": [
        {
            "проблема": "Сервер не запускается",
            "решение": "Проверьте доступность сервера в сети. Перезагрузите сервер и убедитесь, что служба Stakhanovets запущена. Проверьте логи системы на наличие ошибок."
        },
        {
            "проблема": "Пользователи не могут подключиться к серверу",
            "решение": "Проверьте настройки брандмауэра и убедитесь, что порты Stakhanovets открыты. Убедитесь, что сервер доступен по сети. Проверьте, нет ли проблем с лицензией."
        },
        {
            "проблема": "Сервер зависает при высокой нагрузке",
            "решение": "Проверьте загрузку процессора и оперативной памяти. Оптимизируйте настройки логирования и хранения данных. Убедитесь, что сервер обновлен до последней версии."
        },
        {
            "проблема": "Ошибка при авторизации пользователей",
            "решение": "Проверьте учетные данные пользователей и их права доступа. Проверьте подключение к Active Directory, если используется доменная авторизация. Очистите кеш аутентификации и попробуйте снова."
        },
        {
            "проблема": "Данные в отчетах отображаются некорректно",
            "решение": "Перепроверьте настройки сбора данных. Убедитесь, что сервер получает актуальные данные от клиентов. Проверьте, не повреждены ли файлы базы данных."
        },
        {
            "проблема": "Сервер не обновляется",
            "решение": "Проверьте соединение с сервером обновлений. Убедитесь, что у вас есть необходимые права для установки обновлений. Попробуйте выполнить обновление вручную, скачав последнюю версию."
        },
        {
            "проблема": "Служба Stakhanovets часто падает",
            "решение": "Проверьте логи ошибок. Убедитесь, что сервер имеет достаточно ресурсов для работы. Проверьте совместимость с установленными обновлениями операционной системы."
        }
    ],
    "Хранилище данных": [
        {
            "проблема": "Данные не записываются в базу",
            "решение": "Проверьте, запущен ли сервер базы данных. Убедитесь, что у сервера есть достаточно свободного места. Проверьте права записи для Stakhanovets."
        },
        {
            "проблема": "Отчеты загружаются медленно",
            "решение": "Оптимизируйте запросы к базе данных. Проверьте нагрузку на сервер хранения данных. Убедитесь, что сервер не перегружен другими процессами."
        },
        {
            "проблема": "Файлы логов занимают слишком много места",
            "решение": "Настройте автоматическую очистку логов. Перенесите старые логи на другое хранилище. Уменьшите уровень детализации логирования, если это возможно."
        },
        {
            "проблема": "Пропали старые данные из базы",
            "решение": "Проверьте настройки автоархивации данных. Убедитесь, что данные не были удалены из-за политики хранения. Проверьте резервные копии на возможность восстановления."
        },
        {
            "проблема": "Ошибка подключения к хранилищу",
            "решение": "Проверьте доступность хранилища в сети. Убедитесь, что правильные учетные данные используются для подключения. Проверьте конфигурационные файлы Stakhanovets."
        },
        {
            "проблема": "Некорректное отображение данных в отчетах",
            "решение": "Проверьте, что данные корректно записаны в базу. Проверьте настройки фильтров в отчетах. Попробуйте выполнить перерасчет данных вручную."
        },
        {
            "проблема": "Хранилище данных переполнено",
            "решение": "Очистите старые ненужные данные. Настройте автоматическое удаление устаревшей информации. Перенесите данные на другой диск или увеличьте пространство хранения."
        }
    ],
    "Бэкапы": [
        {
            "проблема": "Резервное копирование не запускается",
            "решение": "Проверьте, включена ли задача резервного копирования в расписании. Убедитесь, что у службы есть доступ к месту хранения резервных копий. Проверьте логи на наличие ошибок."
        },
        {
            "проблема": "Файлы резервных копий повреждены",
            "решение": "Проверьте целостность файлов перед восстановлением. Используйте другой носитель для хранения бэкапов. Проверьте наличие ошибок в системе хранения."
        },
        {
            "проблема": "Восстановление данных занимает слишком много времени",
            "решение": "Используйте более производительное хранилище для резервных копий. Проверьте, не загружен ли сервер во время восстановления. Оптимизируйте структуру базы данных перед восстановлением."
        },
        {
            "проблема": "Отсутствуют последние резервные копии",
            "решение": "Проверьте, работает ли автоматическое резервное копирование. Убедитесь, что у системы есть доступ к месту хранения. Проверьте, не было ли ошибок при предыдущих попытках создания копий."
        },
        {
            "проблема": "Бэкапы занимают слишком много места",
            "решение": "Настройте удаление старых резервных копий. Используйте сжатие данных при создании бэкапов. Переносите резервные копии на облачное хранилище или другой сервер."
        },
        {
            "проблема": "Ошибка при восстановлении резервной копии",
            "решение": "Убедитесь, что файл резервной копии не поврежден. Проверьте совместимость версии резервной копии с текущей версией ПО. Попробуйте восстановить копию на тестовом сервере перед развертыванием в рабочей среде."
        },
        {
            "проблема": "Сервер зависает во время резервного копирования",
            "решение": "Настройте выполнение резервного копирования в ночное время. Убедитесь, что сервер имеет достаточно ресурсов для выполнения задачи. Проверьте настройки приоритетов процессов, чтобы не перегружать систему."
        }
    ]
}
